app/controllers/blogs_controller.rb

SELECT * FROM "blogs" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "blogs"
SELECT * FROM "shoutboxes" ORDER BY created_at DESC
SELECT * FROM "blogs" WHERE ("blogs"."members_only" = 'f') ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    #@blogs = Blog.all(:order => "created_at DESC")
    if logged_in?
      @blogs = Blog.paginate :all, :page => params[:page], :order => "created_at DESC", :per_page => 5
      @shoutboxes = Shoutbox.all(:order => "created_at DESC")
    else
      @blogs = Blog.paginate :all, :page => params[:page], :order => "created_at DESC", :per_page => 5, :conditions => {:members_only => false}

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
---
  def show
    @blog = Blog.find(params[:id])

INSERT INTO "blogs" ("created_at", "title", "updated_at", "content", "members_only") VALUES('2010-02-07 12:36:35', 'Neue Homepage', '2010-02-07 12:36:35', 'Very much simpler zu Ziit, aber a dem schrubemer no.', 'f')
---
  def create
    @blog = Blog.new(params[:blog])
    @blog.user = current_user
    if @blog.save

SELECT * FROM "blogs" WHERE ("blogs"."id" = 4)
---
  def edit
    @blog = Blog.find(params[:id])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 3)
UPDATE "blogs" SET "updated_at" = '2010-02-07 16:09:03', "content" = 'M. *ÄKLMÄKL*' WHERE "id" = 3
---
  def update
    @blog = Blog.find(params[:id])
    if @blog.update_attributes(params[:blog])

SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
DELETE FROM "blogs" WHERE "id" = 1
---
  def destroy
    @blog = Blog.find(params[:id])
    @blog.destroy