app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Allgemein', '2010-02-07 12:34:57', '2010-02-07 12:34:57')