app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.blog = Blog.find(params[:blog_id])
    @comment.from_id = current_user.id
    #raise @comment.inspect
    if @comment.save
---
SELECT * FROM "blogs" WHERE ("blogs"."id" = 1)
INSERT INTO "comments" ("created_at", "updated_at", "blog_id", "subject", "from_id", "content", "parent_id") VALUES('2010-02-08 11:24:16', '2010-02-08 11:24:16', 2, 'Test', NULL, 'Test', NULL)

  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(params[:comment])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 7)
UPDATE "comments" SET "updated_at" = '2010-02-08 13:24:51', "content" = 'Nur heute.

  def destroy
    @comment = Comment.find(params[:id])
    blog = @comment.blog
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1