app/controllers/private_messages_controller.rb

SELECT * FROM "private_messages" WHERE ("private_messages"."to_id" = 2) ORDER BY created_at DESC
---
  def index
    @private_messages = PrivateMessage.all(:conditions => {:to_id => current_user}, :order => "created_at DESC")

SELECT * FROM "private_messages" WHERE ("private_messages"."from_id" = 2) ORDER BY created_at DESC
---
  def sent
    @private_messages = PrivateMessage.all(:conditions => {:from_id => current_user}, :order => "created_at DESC")

SELECT * FROM "private_messages" WHERE ("private_messages"."id" = 1)
UPDATE "private_messages" SET "updated_at" = '2010-02-08 08:58:12', "new" = 'f' WHERE "id" = 6
---
  def show
    @private_message = PrivateMessage.find(params[:id])
    unless(current_user.id == @private_message.to_id || current_user.id == @private_message.from_id)
      redirect_to private_messages_url
    end
    @private_message.new = false
    @private_message.save!

SELECT * FROM "private_messages" WHERE ("private_messages"."id" = 4)
SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def reply
    @replied_message = PrivateMessage.find(params[:id])
    @private_message = PrivateMessage.new
    @private_message.to_id = @replied_message.from_id
    @private_message.subject = "Re: #{@replied_message.subject}"
    header = "#{User.find(@replied_message.from_id).username} schrieb am #{@replied_message.created_at.strftime("%d.%m.%Y um %H:%M")}"

SELECT * FROM "private_messages" WHERE ("private_messages"."id" = 4)
INSERT INTO "private_messages" ("new", "created_at", "updated_at", "subject", "from_id", "content", "replyed_with_id", "to_id") VALUES('t', '2010-02-07 22:42:51', '2010-02-07 22:42:51', 'Re: Re: Ziit zum go Pfuuse', 2, 'Ich han eifach Fucking immer rächt :-)
---
  def create
    @private_message = PrivateMessage.new(params[:private_message])
    if params[:reply_id]
        @replied_message = PrivateMessage.find(params[:reply_id])
        @replied_message.replyed_with_id = @private_message
    end
    @private_message.from = current_user
    @private_message.new = true
    if @private_message.save

SELECT * FROM "private_messages" WHERE ("private_messages"."id" = 1)
DELETE FROM "private_messages" WHERE "id" = 1
---
  def destroy
    @private_message = PrivateMessage.find(params[:id])
    @private_message.destroy