app/controllers/shoutboxes_controller.rb

  def index
    @shoutboxes = Shoutbox.all(:order => "created_at DESC")
---
SELECT * FROM "shoutboxes" ORDER BY created_at DESC

  def show
    @shoutbox = Shoutbox.find(params[:id])
---
SELECT * FROM "shoutboxes" WHERE ("shoutboxes"."id" = 1)

  def create
    @shoutbox = Shoutbox.new(params[:shoutbox])
    @shoutbox.user = current_user
    if @shoutbox.save
---
INSERT INTO "shoutboxes" ("created_at", "updated_at", "user_id", "content") VALUES('2010-02-08 13:42:11', '2010-02-08 13:42:11', 1, 'Test')