app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2010-02-07 11:24:05', '2010-02-07 11:24:05', 'Raindancer', '2ed6b666e0cac4f3a96c796a5832f6ceb87f11c6', '2bd349114e5a3e296de0d612256eb0340f7f4963', 'Raindancer@nobrain.ch')